In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=[10,20,30,40,50]
data2=[10.0,20,30,40,50]
s1=pd.Series(data)
s2=pd.Series(data2)
print(s1)
print(s2)

0    10
1    20
2    30
3    40
4    50
dtype: int64
0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [3]:
print(type(s1))
print(type(s2))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
s1.values #gives nd array

array([10, 20, 30, 40, 50])

In [5]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
 s1.dtype

dtype('int64')

In [7]:
data2=["10",20,30]
s2=pd.Series(data2) #gives object because str cant be converted into int
s2.dtype

dtype('O')

In [8]:
s1.index=[101,102,103,104,105]
s1

101    10
102    20
103    30
104    40
105    50
dtype: int64

In [9]:
s1.index=range(101,106)
s1

101    10
102    20
103    30
104    40
105    50
dtype: int64

In [10]:
s1.index=[1.5,1.6,1.7,2.1,3.1]
s1

1.5    10
1.6    20
1.7    30
2.1    40
3.1    50
dtype: int64

In [11]:
s1.index=['A','b','c','d','e']
s1

A    10
b    20
c    30
d    40
e    50
dtype: int64

In [12]:
s1.index

Index(['A', 'b', 'c', 'd', 'e'], dtype='object')

**Accessing data in series**

In [13]:
print(s1[0])
print(s1[-1])
print(s1['A'])
print(s1['d'])

10
50
10
40

In [14]:
#Accessing Using iloc
print(s1.iloc[0] ,end='\n \n')
s1.iloc[[2,1,3]]

10

c    30
b    20
d    40
dtype: int64

In [15]:
#Accessing using loc
print(s1.loc['A'])
s1.loc[['A','c','e']]

10

A    10
c    30
e    50
dtype: int64

In [16]:
print(s1.loc[list(s1.index)])

A    10
b    20
c    30
d    40
e    50
dtype: int64

**ADD Udpade And Delete Operations**

In [17]:
#add
s1['F']=100
s1

A     10
b     20
c     30
d     40
e     50
F    100
dtype: int64

In [18]:
#update
s1['A']=11
s1

A     11
b     20
c     30
d     40
e     50
F    100
dtype: int64

In [19]:
#Delete
s1.drop('d',inplace=True)

In [20]:
s1

A     11
b     20
c     30
e     50
F    100
dtype: int64

**Slicing**

In [21]:
print(s1[:],end='\n')
print(s1[2:5], end='\n')
print(s1[-1::-1])
print(s1[::2])

A     11
b     20
c     30
e     50
F    100
dtype: int64
c     30
e     50
F    100
dtype: int64
F    100
e     50
c     30
b     20
A     11
dtype: int64
A     11
c     30
F    100
dtype: int64

**Creating Series From Dictionary**

In [22]:
dictdata={'Kabir': 88, 'Meera': 74, 'Riya': 91, 'Arjun': 67, 'Zara': 59, 'Ayaan': 83, 'Rahul': 72}
s=pd.Series(dictdata)
s

Kabir    88
Meera    74
Riya     91
Arjun    67
Zara     59
Ayaan    83
Rahul    72
dtype: int64

In [23]:
states_capitals = {
    "Karnataka": "Bengaluru",
    "Maharashtra": "Mumbai",
    "Tamil Nadu": "Chennai",
    "Kerala": "Thiruvananthapuram",
    "Rajasthan": "Jaipur",
    "Gujarat": "Gandhinagar",
    "West Bengal": "Kolkata",
    "Punjab": "Chandigarh",
    "Haryana": "Chandigarh",
    "Uttar Pradesh": "Lucknow",
    "Madhya Pradesh": "Bhopal",
    "Bihar": "Patna",
    "Odisha": "Bhubaneswar"
}
s2=pd.Series(states_capitals)
s2

Karnataka                  Bengaluru
Maharashtra                   Mumbai
Tamil Nadu                   Chennai
Kerala            Thiruvananthapuram
Rajasthan                     Jaipur
Gujarat                  Gandhinagar
West Bengal                  Kolkata
Punjab                    Chandigarh
Haryana                   Chandigarh
Uttar Pradesh                Lucknow
Madhya Pradesh                Bhopal
Bihar                          Patna
Odisha                   Bhubaneswar
dtype: object

In [24]:
#Accessing elements
print(s['Zara'])
print(s2['Punjab'])
print(s[0])
print(s2[0])

59
Chandigarh
88
Bengaluru

In [25]:
print(s1.index, end='\n \n')
print(s2.index)

Index(['A', 'b', 'c', 'e', 'F'], dtype='object')

Index(['Karnataka', 'Maharashtra', 'Tamil Nadu', 'Kerala', 'Rajasthan',
       'Gujarat', 'West Bengal', 'Punjab', 'Haryana', 'Uttar Pradesh',
       'Madhya Pradesh', 'Bihar', 'Odisha'],
      dtype='object')

In [26]:
print(s.values, end='\n \n')
print(s2.values)

[88 74 91 67 59 83 72]

['Bengaluru' 'Mumbai' 'Chennai' 'Thiruvananthapuram' 'Jaipur'
 'Gandhinagar' 'Kolkata' 'Chandigarh' 'Chandigarh' 'Lucknow' 'Bhopal'
 'Patna' 'Bhubaneswar']

In [27]:
s2.loc['Bihar']

'Patna'

In [28]:
s2.loc[list(s2.index)]

Karnataka                  Bengaluru
Maharashtra                   Mumbai
Tamil Nadu                   Chennai
Kerala            Thiruvananthapuram
Rajasthan                     Jaipur
Gujarat                  Gandhinagar
West Bengal                  Kolkata
Punjab                    Chandigarh
Haryana                   Chandigarh
Uttar Pradesh                Lucknow
Madhya Pradesh                Bhopal
Bihar                          Patna
Odisha                   Bhubaneswar
dtype: object

In [29]:
print(s2.iloc[0])
print(s2.iloc[1])
s2.iloc[[1,3,5]]

Bengaluru
Mumbai

Maharashtra                Mumbai
Kerala         Thiruvananthapuram
Gujarat               Gandhinagar
dtype: object

In [30]:
#we can name the series
s2.name="States And Capitals"
s2

Karnataka                  Bengaluru
Maharashtra                   Mumbai
Tamil Nadu                   Chennai
Kerala            Thiruvananthapuram
Rajasthan                     Jaipur
Gujarat                  Gandhinagar
West Bengal                  Kolkata
Punjab                    Chandigarh
Haryana                   Chandigarh
Uttar Pradesh                Lucknow
Madhya Pradesh                Bhopal
Bihar                          Patna
Odisha                   Bhubaneswar
Name: States And Capitals, dtype: object

In [31]:
s2.index.name="States"
s2

States
Karnataka                  Bengaluru
Maharashtra                   Mumbai
Tamil Nadu                   Chennai
Kerala            Thiruvananthapuram
Rajasthan                     Jaipur
Gujarat                  Gandhinagar
West Bengal                  Kolkata
Punjab                    Chandigarh
Haryana                   Chandigarh
Uttar Pradesh                Lucknow
Madhya Pradesh                Bhopal
Bihar                          Patna
Odisha                   Bhubaneswar
Name: States And Capitals, dtype: object

In [32]:
print(s2.index ,end='\n \n')
print(s2.values ,end='\n \n')
print(s2.name ,end='\n \n')
print(s2.index.name ,end='\n \n')
print(s2.dtype)

Index(['Karnataka', 'Maharashtra', 'Tamil Nadu', 'Kerala', 'Rajasthan',
       'Gujarat', 'West Bengal', 'Punjab', 'Haryana', 'Uttar Pradesh',
       'Madhya Pradesh', 'Bihar', 'Odisha'],
      dtype='object', name='States')

['Bengaluru' 'Mumbai' 'Chennai' 'Thiruvananthapuram' 'Jaipur'
 'Gandhinagar' 'Kolkata' 'Chandigarh' 'Chandigarh' 'Lucknow' 'Bhopal'
 'Patna' 'Bhubaneswar']

States And Capitals

States

object

In [33]:
rollno=[101,102,103]
marks=[99,88,98]
s=pd.Series(data=marks,index=rollno)
s.name="Final Marks"
s.index.name="Roll Number"
print(s)

Roll Number
101    99
102    88
103    98
Name: Final Marks, dtype: int64

In [34]:
states=["Karnataka", "Maharashtra", "Tamil Nadu","Telangana", "Assam"]
s3=pd.Series(data=s2,index=states)
s3

Karnataka      Bengaluru
Maharashtra       Mumbai
Tamil Nadu       Chennai
Telangana            NaN
Assam                NaN
Name: States And Capitals, dtype: object

**Functios**

In [35]:
s4=s3.isnull()
s4

Karnataka      False
Maharashtra    False
Tamil Nadu     False
Telangana       True
Assam           True
Name: States And Capitals, dtype: bool

In [36]:
s3.notnull()

Karnataka       True
Maharashtra     True
Tamil Nadu      True
Telangana      False
Assam          False
Name: States And Capitals, dtype: bool

In [37]:
print(s3.isnull().sum())
print(s3.notnull().sum())

2
3

In [38]:
print(s3.head() , end='\n \n')
print(s3.head(2))

Karnataka      Bengaluru
Maharashtra       Mumbai
Tamil Nadu       Chennai
Telangana            NaN
Assam                NaN
Name: States And Capitals, dtype: object

Karnataka      Bengaluru
Maharashtra       Mumbai
Name: States And Capitals, dtype: object

In [39]:
print(s3.tail() , end='\n \n')
print(s3.tail(2))

Karnataka      Bengaluru
Maharashtra       Mumbai
Tamil Nadu       Chennai
Telangana            NaN
Assam                NaN
Name: States And Capitals, dtype: object

Telangana    NaN
Assam        NaN
Name: States And Capitals, dtype: object

In [40]:
s3.index=range(111,116)

In [41]:

s3

111    Bengaluru
112       Mumbai
113      Chennai
114          NaN
115          NaN
Name: States And Capitals, dtype: object

In [42]:
s3[117]="Pune"
s3[118]="Pune"
s3[119]="Pune"
s3

111    Bengaluru
112       Mumbai
113      Chennai
114          NaN
115          NaN
117         Pune
118         Pune
119         Pune
Name: States And Capitals, dtype: object

In [43]:
s3.dropna(inplace=True)
s3

111    Bengaluru
112       Mumbai
113      Chennai
117         Pune
118         Pune
119         Pune
Name: States And Capitals, dtype: object

In [44]:
s3.duplicated()

111    False
112    False
113    False
117    False
118     True
119     True
Name: States And Capitals, dtype: bool

In [45]:
s3.duplicated().sum()

np.int64(2)

In [46]:
s3.dropna().duplicated().sum()

np.int64(2)

In [47]:
s3.drop_duplicates(inplace=True)
s3

111    Bengaluru
112       Mumbai
113      Chennai
117         Pune
Name: States And Capitals, dtype: object

**DataFrames**

In [48]:
emp1 = pd.Series({'Name': 'Rahul', 'ID': 201, 'Gender': 'Male', 'Salary': 50000})
emp2 = pd.Series({'Name': 'Anita', 'ID': 202, 'Gender': 'Female', 'Salary': 55000})
emp3 = pd.Series({'Name': 'Vikram', 'ID': 203, 'Gender': 'Male', 'Salary': 60000})
emp4 = pd.Series({'Name': 'Sneha', 'ID': 204, 'Gender': 'Female', 'Salary': 52000})
emp5 = pd.Series({'Name': 'Arjun', 'ID': 205, 'Gender': 'Male', 'Salary': 58000})
emp6 = pd.Series({'Name': 'Priya', 'ID': 206, 'Gender': 'Female', 'Salary': 61000})
emp7 = pd.Series({'Name': 'Karan', 'ID': 207, 'Gender': 'Male', 'Salary': 53000})
emp8 = pd.Series({'Name': 'Meera', 'ID': 208, 'Gender': 'Female', 'Salary': 59000})
emp9 = pd.Series({'Name': 'Rohit', 'ID': 209, 'Gender': 'Male', 'Salary': 62000})
emp10 = pd.Series({'Name': 'Divya', 'ID': 210, 'Gender': 'Female', 'Salary': 54000})
emp11 = pd.Series({'Name': 'Aman', 'ID': 211, 'Gender': 'Male', 'Salary': 57000})
emp12 = pd.Series({'Name': 'Neha', 'ID': 212, 'Gender': 'Female', 'Salary': 63000})

In [49]:
emp3

Name      Vikram
ID           203
Gender      Male
Salary     60000
dtype: object

In [50]:
employees=[emp1,emp2,emp3,emp4,emp5,emp6,emp7,emp8,emp9,emp10,emp11,emp12]
df1=pd.DataFrame(data=employees,index=range(101,113))
df1

       Name   ID  Gender  Salary
101   Rahul  201    Male   50000
102   Anita  202  Female   55000
103  Vikram  203    Male   60000
104   Sneha  204  Female   52000
105   Arjun  205    Male   58000
106   Priya  206  Female   61000
107   Karan  207    Male   53000
108   Meera  208  Female   59000
109   Rohit  209    Male   62000
110   Divya  210  Female   54000
111    Aman  211    Male   57000
112    Neha  212  Female   63000

In [51]:
type(df1)

pandas.core.frame.DataFrame

In [52]:
print(df1.head() ,end='\n \n')
print(df1.head(2))

       Name   ID  Gender  Salary
101   Rahul  201    Male   50000
102   Anita  202  Female   55000
103  Vikram  203    Male   60000
104   Sneha  204  Female   52000
105   Arjun  205    Male   58000

      Name   ID  Gender  Salary
101  Rahul  201    Male   50000
102  Anita  202  Female   55000

In [53]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 101 to 112
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   ID      12 non-null     int64
 2   Gender  12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [54]:
list(df1.index)

[101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112]

In [55]:
df1.columns

Index(['Name', 'ID', 'Gender', 'Salary'], dtype='object')

In [56]:
df1.values

array([['Rahul', 201, 'Male', 50000],
       ['Anita', 202, 'Female', 55000],
       ['Vikram', 203, 'Male', 60000],
       ['Sneha', 204, 'Female', 52000],
       ['Arjun', 205, 'Male', 58000],
       ['Priya', 206, 'Female', 61000],
       ['Karan', 207, 'Male', 53000],
       ['Meera', 208, 'Female', 59000],
       ['Rohit', 209, 'Male', 62000],
       ['Divya', 210, 'Female', 54000],
       ['Aman', 211, 'Male', 57000],
       ['Neha', 212, 'Female', 63000]], dtype=object)

In [57]:
df1.name='Employee_Details'
df1.index.name='Employee_ID'
#df1.columns.name='Employee_Details'
df1

               Name   ID  Gender  Salary
Employee_ID
101           Rahul  201    Male   50000
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000
107           Karan  207    Male   53000
108           Meera  208  Female   59000
109           Rohit  209    Male   62000
110           Divya  210  Female   54000
111            Aman  211    Male   57000
112            Neha  212  Female   63000

In [58]:
print(df1.name)
print(df1.index.name)

Employee_Details
Employee_ID

In [59]:
df1.describe()

               ID        Salary
count   12.000000     12.000000
mean   206.500000  57000.000000
std      3.605551   4199.567077
min    201.000000  50000.000000
25%    203.750000  53750.000000
50%    206.500000  57500.000000
75%    209.250000  60250.000000
max    212.000000  63000.000000

**Accessing Data From DataFrame**

In [60]:
df1

               Name   ID  Gender  Salary
Employee_ID
101           Rahul  201    Male   50000
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000
107           Karan  207    Male   53000
108           Meera  208  Female   59000
109           Rohit  209    Male   62000
110           Divya  210  Female   54000
111            Aman  211    Male   57000
112            Neha  212  Female   63000

**Accessing Columns**

In [61]:
type(df1['Name'])

pandas.core.series.Series

In [62]:
print(df1['Name'],end='\n \n')
print(df1[['Name','Salary']])

Employee_ID
101     Rahul
102     Anita
103    Vikram
104     Sneha
105     Arjun
106     Priya
107     Karan
108     Meera
109     Rohit
110     Divya
111      Aman
112      Neha
Name: Name, dtype: object

               Name  Salary
Employee_ID
101           Rahul   50000
102           Anita   55000
103          Vikram   60000
104           Sneha   52000
105           Arjun   58000
106           Priya   61000
107           Karan   53000
108           Meera   59000
109           Rohit   62000
110           Divya   54000
111            Aman   57000
112            Neha   63000

In [63]:
print(df1.Name,end='\n \n')
print(df1.Salary)

Employee_ID
101     Rahul
102     Anita
103    Vikram
104     Sneha
105     Arjun
106     Priya
107     Karan
108     Meera
109     Rohit
110     Divya
111      Aman
112      Neha
Name: Name, dtype: object

Employee_ID
101    50000
102    55000
103    60000
104    52000
105    58000
106    61000
107    53000
108    59000
109    62000
110    54000
111    57000
112    63000
Name: Salary, dtype: int64

**Accessing Rows**

In [64]:
df1.loc[101] #Custom Index

Name      Rahul
ID          201
Gender     Male
Salary    50000
Name: 101, dtype: object

In [65]:
df1.loc[[101,103,105]]

               Name   ID Gender  Salary
Employee_ID
101           Rahul  201   Male   50000
103          Vikram  203   Male   60000
105           Arjun  205   Male   58000

In [66]:
df1.iloc[0]

Name      Rahul
ID          201
Gender     Male
Salary    50000
Name: 101, dtype: object

In [67]:
df1.iloc[[0,3,4]]

              Name   ID  Gender  Salary
Employee_ID
101          Rahul  201    Male   50000
104          Sneha  204  Female   52000
105          Arjun  205    Male   58000

**Accessing Specific Values**

In [68]:
df1

               Name   ID  Gender  Salary
Employee_ID
101           Rahul  201    Male   50000
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000
107           Karan  207    Male   53000
108           Meera  208  Female   59000
109           Rohit  209    Male   62000
110           Divya  210  Female   54000
111            Aman  211    Male   57000
112            Neha  212  Female   63000

In [69]:
print(df1.loc[101],end='\n \n')
print(df1.loc[101]['Salary'])

Name      Rahul
ID          201
Gender     Male
Salary    50000
Name: 101, dtype: object

50000

In [70]:
print(df1.iloc[0]['Salary'])
print(df1.iloc[3]['Salary'])

50000
52000

In [71]:
print(df1['Salary'][101] , end='\n \n')
print(df1['ID'][101])

50000

201

In [72]:
print(df1.Name[108],end='\n \n')
print(df1.Salary[108])

Meera

59000

In [73]:
df1.loc[[101,104,108]]['Salary']

Employee_ID
101    50000
104    52000
108    59000
Name: Salary, dtype: int64

In [74]:
df1.loc[[101,104,108]][['Salary','Name']]

             Salary   Name
Employee_ID
101           50000  Rahul
104           52000  Sneha
108           59000  Meera

In [75]:
print(df1.loc[104,'Salary'],end='\n \n')
print(df1.loc[104,['Salary','ID']],end='\n \n')
print(df1.loc[[104,102,101],['Salary','ID']],end='\n \n')
print(df1.loc[102:106],end='\n \n')
print(df1.loc[102:106],['Salary','ID'],end='\n \n')
print(df1.loc[101:109,['Salary','ID']])

52000

Salary    52000
ID          204
Name: 104, dtype: object

             Salary   ID
Employee_ID
104           52000  204
102           55000  202
101           50000  201

               Name   ID  Gender  Salary
Employee_ID
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000

               Name   ID  Gender  Salary
Employee_ID
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000 ['Salary', 'ID']

             Salary   ID
Employee_ID
101           50000  201
102           55000  202
103           60000  203
104           52000  204
105           58000  205
106           61000  206
107           53000  207
108           59000  208
109           62000  209

In [76]:
df1.iloc[[1,2,3]][['Salary','ID']]

             Salary   ID
Employee_ID
102           55000  202
103           60000  203
104           52000  204

In [77]:
print(df1.iloc[2]['Name'],end='\n \n')
print(df1.iloc[[0,2,3]][['Name','Salary']],end='\n \n')

Vikram

               Name  Salary
Employee_ID
101           Rahul   50000
103          Vikram   60000
104           Sneha   52000

In [78]:
print(df1['Name'],end='\n \n')
print(df1.loc[101],end='\n \n')
print(df1.loc[101,'Salary'])

Employee_ID
101     Rahul
102     Anita
103    Vikram
104     Sneha
105     Arjun
106     Priya
107     Karan
108     Meera
109     Rohit
110     Divya
111      Aman
112      Neha
Name: Name, dtype: object

Name      Rahul
ID          201
Gender     Male
Salary    50000
Name: 101, dtype: object

50000

**Adding and Deleting Rows and Columns**

In [79]:
df1

               Name   ID  Gender  Salary
Employee_ID
101           Rahul  201    Male   50000
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000
107           Karan  207    Male   53000
108           Meera  208  Female   59000
109           Rohit  209    Male   62000
110           Divya  210  Female   54000
111            Aman  211    Male   57000
112            Neha  212  Female   63000

In [80]:
#Add Row
df1.loc[113]=["prithi",213,'Female',71000]

In [81]:
df1

               Name   ID  Gender  Salary
Employee_ID
101           Rahul  201    Male   50000
102           Anita  202  Female   55000
103          Vikram  203    Male   60000
104           Sneha  204  Female   52000
105           Arjun  205    Male   58000
106           Priya  206  Female   61000
107           Karan  207    Male   53000
108           Meera  208  Female   59000
109           Rohit  209    Male   62000
110           Divya  210  Female   54000
111            Aman  211    Male   57000
112            Neha  212  Female   63000
113          prithi  213  Female   71000

In [82]:
#add column
import numpy as np
df1['Age']=np.random.randint(21,30,13)

In [83]:
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male   50000   23
102           Anita  202  Female   55000   26
103          Vikram  203    Male   60000   27
104           Sneha  204  Female   52000   22
105           Arjun  205    Male   58000   29
106           Priya  206  Female   61000   26
107           Karan  207    Male   53000   22
108           Meera  208  Female   59000   28
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   28
112            Neha  212  Female   63000   23
113          prithi  213  Female   71000   27

In [84]:
#delete Row
df1.drop(113,inplace=True,axis=0)
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male   50000   23
102           Anita  202  Female   55000   26
103          Vikram  203    Male   60000   27
104           Sneha  204  Female   52000   22
105           Arjun  205    Male   58000   29
106           Priya  206  Female   61000   26
107           Karan  207    Male   53000   22
108           Meera  208  Female   59000   28
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   28
112            Neha  212  Female   63000   23

In [85]:
#delete Column
df1['City']="Hyd"
#df1["city"]=['Hyd','Vij'] gives Length mismatch error
df1

               Name   ID  Gender  Salary  Age City
Employee_ID
101           Rahul  201    Male   50000   23  Hyd
102           Anita  202  Female   55000   26  Hyd
103          Vikram  203    Male   60000   27  Hyd
104           Sneha  204  Female   52000   22  Hyd
105           Arjun  205    Male   58000   29  Hyd
106           Priya  206  Female   61000   26  Hyd
107           Karan  207    Male   53000   22  Hyd
108           Meera  208  Female   59000   28  Hyd
109           Rohit  209    Male   62000   28  Hyd
110           Divya  210  Female   54000   25  Hyd
111            Aman  211    Male   57000   28  Hyd
112            Neha  212  Female   63000   23  Hyd

In [86]:
df1.drop('City',inplace=True,axis=1)
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male   50000   23
102           Anita  202  Female   55000   26
103          Vikram  203    Male   60000   27
104           Sneha  204  Female   52000   22
105           Arjun  205    Male   58000   29
106           Priya  206  Female   61000   26
107           Karan  207    Male   53000   22
108           Meera  208  Female   59000   28
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   28
112            Neha  212  Female   63000   23

In [87]:
#update Row
df1['Salary'][101]=100000
#update multipule rows at same time
df1.loc[[101,103],'Salary']=[200000,50000]
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male  200000   23
102           Anita  202  Female   55000   26
103          Vikram  203    Male   50000   27
104           Sneha  204  Female   52000   22
105           Arjun  205    Male   58000   29
106           Priya  206  Female   61000   26
107           Karan  207    Male   53000   22
108           Meera  208  Female   59000   28
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   28
112            Neha  212  Female   63000   23

In [88]:
df1['Age']=1
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male  200000    1
102           Anita  202  Female   55000    1
103          Vikram  203    Male   50000    1
104           Sneha  204  Female   52000    1
105           Arjun  205    Male   58000    1
106           Priya  206  Female   61000    1
107           Karan  207    Male   53000    1
108           Meera  208  Female   59000    1
109           Rohit  209    Male   62000    1
110           Divya  210  Female   54000    1
111            Aman  211    Male   57000    1
112            Neha  212  Female   63000    1

In [89]:
df1['Age']=np.random.randint(22,30,12)

**Quering Based on Condition**

In [90]:
df1

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male  200000   22
102           Anita  202  Female   55000   29
103          Vikram  203    Male   50000   23
104           Sneha  204  Female   52000   24
105           Arjun  205    Male   58000   24
106           Priya  206  Female   61000   29
107           Karan  207    Male   53000   28
108           Meera  208  Female   59000   23
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   24
112            Neha  212  Female   63000   28

In [91]:
df1.Age>40

Employee_ID
101    False
102    False
103    False
104    False
105    False
106    False
107    False
108    False
109    False
110    False
111    False
112    False
Name: Age, dtype: bool

In [92]:
df1[df1.Age>25]

              Name   ID  Gender  Salary  Age
Employee_ID
102          Anita  202  Female   55000   29
106          Priya  206  Female   61000   29
107          Karan  207    Male   53000   28
109          Rohit  209    Male   62000   28
112           Neha  212  Female   63000   28

In [93]:
df1[df1.Age>25][['Age','Name','Salary']]

             Age   Name  Salary
Employee_ID
102           29  Anita   55000
106           29  Priya   61000
107           28  Karan   53000
109           28  Rohit   62000
112           28   Neha   63000

In [94]:
df1[df1.Salary>50000][['Name','Salary']]

              Name  Salary
Employee_ID
101          Rahul  200000
102          Anita   55000
104          Sneha   52000
105          Arjun   58000
106          Priya   61000
107          Karan   53000
108          Meera   59000
109          Rohit   62000
110          Divya   54000
111           Aman   57000
112           Neha   63000

In [95]:
df1[df1.Gender=="Male"]

               Name   ID Gender  Salary  Age
Employee_ID
101           Rahul  201   Male  200000   22
103          Vikram  203   Male   50000   23
105           Arjun  205   Male   58000   24
107           Karan  207   Male   53000   28
109           Rohit  209   Male   62000   28
111            Aman  211   Male   57000   24

In [96]:
df1[df1.Gender=="Male"][df1.Salary>=60000]

              Name   ID Gender  Salary  Age
Employee_ID
101          Rahul  201   Male  200000   22
109          Rohit  209   Male   62000   28

In [97]:
df1[df1.Gender=="Female"][df1.Salary<=60000]

              Name   ID  Gender  Salary  Age
Employee_ID
102          Anita  202  Female   55000   29
104          Sneha  204  Female   52000   24
108          Meera  208  Female   59000   23
110          Divya  210  Female   54000   25

In [98]:
df1[(df1.Gender=='Male')&(df1.Salary>=60000)]

              Name   ID Gender  Salary  Age
Employee_ID
101          Rahul  201   Male  200000   22
109          Rohit  209   Male   62000   28

In [99]:
df1[(df1.Gender=='Male')| (df1.Salary>=60000)]

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male  200000   22
103          Vikram  203    Male   50000   23
105           Arjun  205    Male   58000   24
106           Priya  206  Female   61000   29
107           Karan  207    Male   53000   28
109           Rohit  209    Male   62000   28
111            Aman  211    Male   57000   24
112            Neha  212  Female   63000   28

In [100]:
df1[df1.Gender=="Male"][df1.Salary>=60000][df1.Salary<100000][df1.Age<40] # we can gove unlimited Conditions

              Name   ID Gender  Salary  Age
Employee_ID
109          Rohit  209   Male   62000   28

In [101]:
df1[df1.Gender=="Male"][df1.Salary>=60000][df1.Salary<100000][df1.Age<40][['Name','Gender','Salary']]

              Name Gender  Salary
Employee_ID
109          Rohit   Male   62000

**Query Fuction**

In [102]:
df1.query('Salary>10000 and Age<40')

               Name   ID  Gender  Salary  Age
Employee_ID
101           Rahul  201    Male  200000   22
102           Anita  202  Female   55000   29
103          Vikram  203    Male   50000   23
104           Sneha  204  Female   52000   24
105           Arjun  205    Male   58000   24
106           Priya  206  Female   61000   29
107           Karan  207    Male   53000   28
108           Meera  208  Female   59000   23
109           Rohit  209    Male   62000   28
110           Divya  210  Female   54000   25
111            Aman  211    Male   57000   24
112            Neha  212  Female   63000   28

In [103]:
df1.query('Gender=="Female" or Salary>50000')

              Name   ID  Gender  Salary  Age
Employee_ID
101          Rahul  201    Male  200000   22
102          Anita  202  Female   55000   29
104          Sneha  204  Female   52000   24
105          Arjun  205    Male   58000   24
106          Priya  206  Female   61000   29
107          Karan  207    Male   53000   28
108          Meera  208  Female   59000   23
109          Rohit  209    Male   62000   28
110          Divya  210  Female   54000   25
111           Aman  211    Male   57000   24
112           Neha  212  Female   63000   28

In [104]:
df1.query('Gender=="Female" or Salary>50000')[['Name','Age']]

              Name  Age
Employee_ID
101          Rahul   22
102          Anita   29
104          Sneha   24
105          Arjun   24
106          Priya   29
107          Karan   28
108          Meera   23
109          Rohit   28
110          Divya   25
111           Aman   24
112           Neha   28

In [105]:
df1[df1.Salary>df1.Salary.mean()]

              Name   ID Gender  Salary  Age
Employee_ID
101          Rahul  201   Male  200000   22

In [106]:
df1.query('Salary >' + str(df1.Salary.mean()))

              Name   ID Gender  Salary  Age
Employee_ID
101          Rahul  201   Male  200000   22

**Important Functions**

In [107]:
df1.loc[113]=df1.loc[104]
df1.loc[114]=df1.loc[105]
df1.loc[115]=['Kaviya',215,'Female',np.nan,np.nan]
df1.loc[116]=['Rehan',216,"Male",180000,20]
df1.loc[117]=['Mohan',217,"Male",np.nan,np.nan]
df1

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0
106           Priya  206  Female   61000.0  29.0
107           Karan  207    Male   53000.0  28.0
108           Meera  208  Female   59000.0  23.0
109           Rohit  209    Male   62000.0  28.0
110           Divya  210  Female   54000.0  25.0
111            Aman  211    Male   57000.0  24.0
112            Neha  212  Female   63000.0  28.0
113           Sneha  204  Female   52000.0  24.0
114           Arjun  205    Male   58000.0  24.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN

In [108]:
df1.head()

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0

In [109]:
df1.head(3)

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0

In [110]:
df1.tail()

               Name   ID  Gender    Salary   Age
Employee_ID
113           Sneha  204  Female   52000.0  24.0
114           Arjun  205    Male   58000.0  24.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN

In [111]:
df1.tail(2)

              Name   ID Gender    Salary   Age
Employee_ID
116          Rehan  216   Male  180000.0  20.0
117          Mohan  217   Male       NaN   NaN

In [112]:
df1.isnull().sum()

Name      0
ID        0
Gender    0
Salary    2
Age       2
dtype: int64

In [113]:
df1.Salary.isnull().sum()

np.int64(2)

In [114]:
df1.notnull().sum()

Name      17
ID        17
Gender    17
Salary    15
Age       15
dtype: int64

In [115]:
df1.isna()

              Name     ID  Gender  Salary    Age
Employee_ID
101          False  False   False   False  False
102          False  False   False   False  False
103          False  False   False   False  False
104          False  False   False   False  False
105          False  False   False   False  False
106          False  False   False   False  False
107          False  False   False   False  False
108          False  False   False   False  False
109          False  False   False   False  False
110          False  False   False   False  False
111          False  False   False   False  False
112          False  False   False   False  False
113          False  False   False   False  False
114          False  False   False   False  False
115          False  False   False    True   True
116          False  False   False   False  False
117          False  False   False    True   True

In [116]:
df1.isna().sum()

Name      0
ID        0
Gender    0
Salary    2
Age       2
dtype: int64

In [117]:
df1.isnull()

              Name     ID  Gender  Salary    Age
Employee_ID
101          False  False   False   False  False
102          False  False   False   False  False
103          False  False   False   False  False
104          False  False   False   False  False
105          False  False   False   False  False
106          False  False   False   False  False
107          False  False   False   False  False
108          False  False   False   False  False
109          False  False   False   False  False
110          False  False   False   False  False
111          False  False   False   False  False
112          False  False   False   False  False
113          False  False   False   False  False
114          False  False   False   False  False
115          False  False   False    True   True
116          False  False   False   False  False
117          False  False   False    True   True

In [118]:
df1.duplicated()

Employee_ID
101    False
102    False
103    False
104    False
105    False
106    False
107    False
108    False
109    False
110    False
111    False
112    False
113     True
114     True
115    False
116    False
117    False
dtype: bool

In [119]:
df1.duplicated().sum()

np.int64(2)

In [120]:
df1.drop_duplicates(inplace=True)
df1

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0
106           Priya  206  Female   61000.0  29.0
107           Karan  207    Male   53000.0  28.0
108           Meera  208  Female   59000.0  23.0
109           Rohit  209    Male   62000.0  28.0
110           Divya  210  Female   54000.0  25.0
111            Aman  211    Male   57000.0  24.0
112            Neha  212  Female   63000.0  28.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN

In [121]:
df1.nunique()

Name      15
ID        15
Gender     2
Salary    13
Age        7
dtype: int64

In [122]:
df1['Salary'].nunique()

13

In [123]:
df1['Salary'].unique()

array([200000.,  55000.,  50000.,  52000.,  58000.,  61000.,  53000.,
        59000.,  62000.,  54000.,  57000.,  63000.,     nan, 180000.])

In [124]:
df1['Gender'].dropna().unique()

array(['Male', 'Female'], dtype=object)

In [125]:
df1.sort_index()

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0
106           Priya  206  Female   61000.0  29.0
107           Karan  207    Male   53000.0  28.0
108           Meera  208  Female   59000.0  23.0
109           Rohit  209    Male   62000.0  28.0
110           Divya  210  Female   54000.0  25.0
111            Aman  211    Male   57000.0  24.0
112            Neha  212  Female   63000.0  28.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN

In [126]:
df1.sort_index(ascending=False)

               Name   ID  Gender    Salary   Age
Employee_ID
117           Mohan  217    Male       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
115          Kaviya  215  Female       NaN   NaN
112            Neha  212  Female   63000.0  28.0
111            Aman  211    Male   57000.0  24.0
110           Divya  210  Female   54000.0  25.0
109           Rohit  209    Male   62000.0  28.0
108           Meera  208  Female   59000.0  23.0
107           Karan  207    Male   53000.0  28.0
106           Priya  206  Female   61000.0  29.0
105           Arjun  205    Male   58000.0  24.0
104           Sneha  204  Female   52000.0  24.0
103          Vikram  203    Male   50000.0  23.0
102           Anita  202  Female   55000.0  29.0
101           Rahul  201    Male  200000.0  22.0

In [127]:
df1.sort_values(by='Salary')

               Name   ID  Gender    Salary   Age
Employee_ID
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
107           Karan  207    Male   53000.0  28.0
110           Divya  210  Female   54000.0  25.0
102           Anita  202  Female   55000.0  29.0
111            Aman  211    Male   57000.0  24.0
105           Arjun  205    Male   58000.0  24.0
108           Meera  208  Female   59000.0  23.0
106           Priya  206  Female   61000.0  29.0
109           Rohit  209    Male   62000.0  28.0
112            Neha  212  Female   63000.0  28.0
116           Rehan  216    Male  180000.0  20.0
101           Rahul  201    Male  200000.0  22.0
115          Kaviya  215  Female       NaN   NaN
117           Mohan  217    Male       NaN   NaN

In [128]:
df1.sort_values(by='Salary',ascending=False)

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
116           Rehan  216    Male  180000.0  20.0
112            Neha  212  Female   63000.0  28.0
109           Rohit  209    Male   62000.0  28.0
106           Priya  206  Female   61000.0  29.0
108           Meera  208  Female   59000.0  23.0
105           Arjun  205    Male   58000.0  24.0
111            Aman  211    Male   57000.0  24.0
102           Anita  202  Female   55000.0  29.0
110           Divya  210  Female   54000.0  25.0
107           Karan  207    Male   53000.0  28.0
104           Sneha  204  Female   52000.0  24.0
103          Vikram  203    Male   50000.0  23.0
115          Kaviya  215  Female       NaN   NaN
117           Mohan  217    Male       NaN   NaN

In [129]:
df1.sort_values(by=['Age','Salary'])

               Name   ID  Gender    Salary   Age
Employee_ID
116           Rehan  216    Male  180000.0  20.0
101           Rahul  201    Male  200000.0  22.0
103          Vikram  203    Male   50000.0  23.0
108           Meera  208  Female   59000.0  23.0
104           Sneha  204  Female   52000.0  24.0
111            Aman  211    Male   57000.0  24.0
105           Arjun  205    Male   58000.0  24.0
110           Divya  210  Female   54000.0  25.0
107           Karan  207    Male   53000.0  28.0
109           Rohit  209    Male   62000.0  28.0
112            Neha  212  Female   63000.0  28.0
102           Anita  202  Female   55000.0  29.0
106           Priya  206  Female   61000.0  29.0
115          Kaviya  215  Female       NaN   NaN
117           Mohan  217    Male       NaN   NaN

In [130]:
pd.concat([df1,df1],axis=0)

               Name   ID  Gender    Salary   Age
Employee_ID
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0
106           Priya  206  Female   61000.0  29.0
107           Karan  207    Male   53000.0  28.0
108           Meera  208  Female   59000.0  23.0
109           Rohit  209    Male   62000.0  28.0
110           Divya  210  Female   54000.0  25.0
111            Aman  211    Male   57000.0  24.0
112            Neha  212  Female   63000.0  28.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN
101           Rahul  201    Male  200000.0  22.0
102           Anita  202  Female   55000.0  29.0
103          Vikram  203    Male   50000.0  23.0
104           Sneha  204  Female   52000.0  24.0
105           Arjun  205    Male   58000.0  24.0
106           Priya  206  Female   61000.0  29.0
107           Karan  207    Male   53000.0  28.0
108           Meera  208  Female   59000.0  23.0
109           Rohit  209    Male   62000.0  28.0
110           Divya  210  Female   54000.0  25.0
111            Aman  211    Male   57000.0  24.0
112            Neha  212  Female   63000.0  28.0
115          Kaviya  215  Female       NaN   NaN
116           Rehan  216    Male  180000.0  20.0
117           Mohan  217    Male       NaN   NaN

In [131]:
pd.concat([df1,df1],axis=1)

,Name,ID,Gender,Salary,Age,Name,ID,Gender,Salary,Age
Employee_ID,,,,,,,,,,
101,Rahul,201,Male,200000.0,22.0,Rahul,201,Male,200000.0,22.0
102,Anita,202,Female,55000.0,29.0,Anita,202,Female,55000.0,29.0
103,Vikram,203,Male,50000.0,23.0,Vikram,203,Male,50000.0,23.0
104,Sneha,204,Female,52000.0,24.0,Sneha,204,Female,52000.0,24.0
105,Arjun,205,Male,58000.0,24.0,Arjun,205,Male,58000.0,24.0
106,Priya,206,Female,61000.0,29.0,Priya,206,Female,61000.0,29.0
107,Karan,207,Male,53000.0,28.0,Karan,207,Male,53000.0,28.0
108,Meera,208,Female,59000.0,23.0,Meera,208,Female,59000.0,23.0
109,Rohit,209,Male,62000.0,28.0,Rohit,209,Male,62000.0,28.0
110,Divya,210,Female,54000.0,25.0,Divya,210,Female,54000.0,25.0
111,Aman,211,Male,57000.0,24.0,Aman,211,Male,57000.0,24.0
112,Neha,212,Female,63000.0,28.0,Neha,212,Female,63000.0,28.0
115,Kaviya,215,Female,NaN,NaN,Kaviya,215,Female,NaN,NaN
116,Rehan,216,Male,180000.0,20.0,Rehan,216,Male,180000.0,20.0
117,Mohan,217,Male,NaN,NaN,Mohan,217,Male,NaN,NaN

In [132]:
df1.Salary.value_counts()

Salary
200000.0    1
55000.0     1
50000.0     1
52000.0     1
58000.0     1
61000.0     1
53000.0     1
59000.0     1
62000.0     1
54000.0     1
57000.0     1
63000.0     1
180000.0    1
Name: count, dtype: int64

In [133]:
df1.Gender.value_counts()

Gender
Male      8
Female    7
Name: count, dtype: int64

In [134]:
df1.Gender.value_counts(normalize=True) # ratio of distribution

Gender
Male      0.533333
Female    0.466667
Name: proportion, dtype: float64

In [135]:
df1.describe()

               ID         Salary        Age
count   15.000000      13.000000  13.000000
mean   208.400000   77230.769231  25.153846
std      5.082182   50367.241083   2.939562
min    201.000000   50000.000000  20.000000
25%    204.500000   54000.000000  23.000000
50%    208.000000   58000.000000  24.000000
75%    211.500000   62000.000000  28.000000
max    217.000000  200000.000000  29.000000

In [136]:
df1[['Age','Salary']].describe()

             Age         Salary
count  13.000000      13.000000
mean   25.153846   77230.769231
std     2.939562   50367.241083
min    20.000000   50000.000000
25%    23.000000   54000.000000
50%    24.000000   58000.000000
75%    28.000000   62000.000000
max    29.000000  200000.000000

In [137]:
df1.count()

Name      15
ID        15
Gender    15
Salary    13
Age       13
dtype: int64

In [138]:
df1.Salary.mean()

np.float64(77230.76923076923)

In [139]:
df1.Salary.var()

2536858974.358975

In [140]:
df1.Salary.std()

50367.24108345597

In [141]:
df1.Salary.median()

58000.0

In [142]:
df1.Age.mode()

0    24.0
1    28.0
Name: Age, dtype: float64

In [143]:
df1.Age.value_counts()

Age
24.0    3
28.0    3
29.0    2
23.0    2
22.0    1
25.0    1
20.0    1
Name: count, dtype: int64

In [144]:
df1.Age.quantile(0.25)

np.float64(23.0)

In [145]:
df1.Age.quantile(0.5)

np.float64(24.0)

In [146]:
df1.Age.quantile(0.75)

np.float64(28.0)

In [147]:
df1['Salary'].apply(np.sqrt)

Employee_ID
101    447.213595
102    234.520788
103    223.606798
104    228.035085
105    240.831892
106    246.981781
107    230.217289
108    242.899156
109    248.997992
110    232.379001
111    238.746728
112    250.998008
115           NaN
116    424.264069
117           NaN
Name: Salary, dtype: float64

In [148]:
df1.Salary.apply(lambda num: 1.1* num)

Employee_ID
101    220000.0
102     60500.0
103     55000.0
104     57200.0
105     63800.0
106     67100.0
107     58300.0
108     64900.0
109     68200.0
110     59400.0
111     62700.0
112     69300.0
115         NaN
116    198000.0
117         NaN
Name: Salary, dtype: float64

In [149]:
df1.groupby(by='Gender')['Age'].mean()

Gender
Female    26.333333
Male      24.142857
Name: Age, dtype: float64

In [150]:
df1[['Salary','Age']].cov()

              Salary           Age
Salary  2.536859e+09 -86788.461538
Age    -8.678846e+04      8.641026

In [151]:
df1[['Salary','Age']].corr()

         Salary      Age
Salary  1.00000 -0.58618
Age    -0.58618  1.00000

**Dealing with csv files**

In [152]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [155]:
data=pd.read_csv("/content/drive/MyDrive/Contnet/Automobile_data.csv")

In [156]:
data

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
201,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
202,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
203,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.4,23.0,106,4800,26,27,22470
204,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [157]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 26 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   symboling          205 non-null    int64
 1   normalized-losses  205 non-null    object
 2   make               205 non-null    object
 3   fuel-type          205 non-null    object
 4   aspiration         205 non-null    object
 5   num-of-doors       205 non-null    object
 6   body-style         205 non-null    object
 7   drive-wheels       205 non-null    object
 8   engine-location    205 non-null    object
 9   wheel-base         205 non-null    float64
 10  length             205 non-null    float64
 11  width              205 non-null    float64
 12  height             205 non-null    float64
 13  curb-weight        205 non-null    int64
 14  engine-type        205 non-null    object
 15  num-of-cylinders   205 non-null    object
 16  engine-size        205 non-null    int64
 17  fuel-system        205 non-null    object
 18  bore               205 non-null    object
 19  stroke             205 non-null    object
 20  compression-ratio  205 non-null    float64
 21  horsepower         205 non-null    object
 22  peak-rpm           205 non-null    object
 23  city-mpg           205 non-null    int64
 24  highway-mpg        205 non-null    int64
 25  price              205 non-null    object
dtypes: float64(5), int64(5), object(16)
memory usage: 41.8+ KB

In [158]:
list(data.columns)

['symboling',
 'normalized-losses',
 'make',
 'fuel-type',
 'aspiration',
 'num-of-doors',
 'body-style',
 'drive-wheels',
 'engine-location',
 'wheel-base',
 'length',
 'width',
 'height',
 'curb-weight',
 'engine-type',
 'num-of-cylinders',
 'engine-size',
 'fuel-system',
 'bore',
 'stroke',
 'compression-ratio',
 'horsepower',
 'peak-rpm',
 'city-mpg',
 'highway-mpg',
 'price']

In [159]:
data.duplicated().sum()

np.int64(0)

In [160]:
data.shape

(205, 26)

In [161]:
data.isnull().sum()

symboling            0
normalized-losses    0
make                 0
fuel-type            0
aspiration           0
num-of-doors         0
body-style           0
drive-wheels         0
engine-location      0
wheel-base           0
length               0
width                0
height               0
curb-weight          0
engine-type          0
num-of-cylinders     0
engine-size          0
fuel-system          0
bore                 0
stroke               0
compression-ratio    0
horsepower           0
peak-rpm             0
city-mpg             0
highway-mpg          0
price                0
dtype: int64

In [162]:
data.head()

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,?,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,?,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450

In [163]:
data.replace('?',np.nan,inplace=True)

In [164]:
data.head()

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,engine-size,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.4,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.4,8.0,115,5500,18,22,17450

In [165]:
data.isnull().sum()

symboling             0
normalized-losses    41
make                  0
fuel-type             0
aspiration            0
num-of-doors          2
body-style            0
drive-wheels          0
engine-location       0
wheel-base            0
length                0
width                 0
height                0
curb-weight           0
engine-type           0
num-of-cylinders      0
engine-size           0
fuel-system           0
bore                  4
stroke                4
compression-ratio     0
horsepower            2
peak-rpm              2
city-mpg              0
highway-mpg           0
price                 4
dtype: int64

In [166]:
data['price']=data['price'].astype(float)
data['peak-rpm']=data['peak-rpm'].astype(float)
data['hoursepower']=data['horsepower'].astype(float)

In [167]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 27 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   symboling          205 non-null    int64
 1   normalized-losses  164 non-null    object
 2   make               205 non-null    object
 3   fuel-type          205 non-null    object
 4   aspiration         205 non-null    object
 5   num-of-doors       203 non-null    object
 6   body-style         205 non-null    object
 7   drive-wheels       205 non-null    object
 8   engine-location    205 non-null    object
 9   wheel-base         205 non-null    float64
 10  length             205 non-null    float64
 11  width              205 non-null    float64
 12  height             205 non-null    float64
 13  curb-weight        205 non-null    int64
 14  engine-type        205 non-null    object
 15  num-of-cylinders   205 non-null    object
 16  engine-size        205 non-null    int64
 17  fuel-system        205 non-null    object
 18  bore               201 non-null    object
 19  stroke             201 non-null    object
 20  compression-ratio  205 non-null    float64
 21  horsepower         203 non-null    object
 22  peak-rpm           203 non-null    float64
 23  city-mpg           205 non-null    int64
 24  highway-mpg        205 non-null    int64
 25  price              201 non-null    float64
 26  hoursepower        203 non-null    float64
dtypes: float64(8), int64(5), object(14)
memory usage: 43.4+ KB

In [168]:
data.head(10)

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,fuel-system,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price,hoursepower
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111,5000.0,21,27,13495.0,111.0
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,mpfi,3.47,2.68,9.0,111,5000.0,21,27,16500.0,111.0
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,mpfi,2.68,3.47,9.0,154,5000.0,19,26,16500.0,154.0
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,mpfi,3.19,3.4,10.0,102,5500.0,24,30,13950.0,102.0
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,mpfi,3.19,3.4,8.0,115,5500.0,18,22,17450.0,115.0
5,2,NaN,audi,gas,std,two,sedan,fwd,front,99.8,...,mpfi,3.19,3.4,8.5,110,5500.0,19,25,15250.0,110.0
6,1,158,audi,gas,std,four,sedan,fwd,front,105.8,...,mpfi,3.19,3.4,8.5,110,5500.0,19,25,17710.0,110.0
7,1,NaN,audi,gas,std,four,wagon,fwd,front,105.8,...,mpfi,3.19,3.4,8.5,110,5500.0,19,25,18920.0,110.0
8,1,158,audi,gas,turbo,four,sedan,fwd,front,105.8,...,mpfi,3.13,3.4,8.3,140,5500.0,17,20,23875.0,140.0
9,0,NaN,audi,gas,turbo,two,hatchback,4wd,front,99.5,...,mpfi,3.13,3.4,7.0,160,5500.0,16,22,NaN,160.0

In [169]:
data.nunique()

symboling              6
normalized-losses     51
make                  22
fuel-type              2
aspiration             2
num-of-doors           2
body-style             5
drive-wheels           3
engine-location        2
wheel-base            53
length                75
width                 44
height                49
curb-weight          171
engine-type            7
num-of-cylinders       7
engine-size           44
fuel-system            8
bore                  38
stroke                36
compression-ratio     32
horsepower            59
peak-rpm              23
city-mpg              29
highway-mpg           30
price                186
hoursepower           59
dtype: int64

In [170]:
print('Fuel Types : ',data['fuel-type'].unique())
print('Body Styles : ',data['body-style'].unique())
print('Driver Wheels : ', data['body-style'].unique())
print('Fuel System : ',data['fuel-system'].unique())
print('Engine Type : ',data['engine-type'].unique())

Fuel Types :  ['gas' 'diesel']
Body Styles :  ['convertible' 'hatchback' 'sedan' 'wagon' 'hardtop']
Driver Wheels :  ['convertible' 'hatchback' 'sedan' 'wagon' 'hardtop']
Fuel System :  ['mpfi' '2bbl' 'mfi' '1bbl' 'spfi' '4bbl' 'idi' 'spdi']
Engine Type :  ['dohc' 'ohcv' 'ohc' 'l' 'rotor' 'ohcf' 'dohcv']

In [171]:
data['city-mpg'].mean()

np.float64(25.21951219512195)

In [172]:
data.groupby(by='fuel-type')['city-mpg'].mean()

fuel-type
diesel    30.30000
gas       24.67027
Name: city-mpg, dtype: float64

In [173]:
data.groupby(by='body-style').value_counts()

body-style   symboling  normalized-losses  make           fuel-type  aspiration  num-of-doors  drive-wheels  engine-location  wheel-base  length  width  height  curb-weight  engine-type  num-of-cylinders  engine-size  fuel-system  bore  stroke  compression-ratio  horsepower  peak-rpm  city-mpg  highway-mpg  price    hoursepower
convertible  2          134                toyota         gas        std         two           rwd           front            98.4        176.2   65.6   53.0    2975         ohc          four              146          mpfi         3.62  3.5     9.3                116         4800.0    24        30           17669.0  116.0          1
             3          142                mercedes-benz  gas        std         two           rwd           front            96.6        180.3   70.5   50.8    3685         ohcv         eight             234          mpfi         3.46  3.1     8.3                155         4750.0    16        18           35056.0  155.0          1
hardtop      0          93                 mercedes-benz  diesel     turbo       two           rwd           front            106.7       187.5   70.3   54.9    3495         ohc          five              183          idi          3.58  3.64    21.5               123         4350.0    22        25           28176.0  123.0          1
             2          134                toyota         gas        std         two           rwd           front            98.4        176.2   65.6   52.0    2536         ohc          four              146          mpfi         3.62  3.5     9.3                116         4800.0    24        30           9639.0   116.0          1
                                                                                                                                                                 2540         ohc          four              146          mpfi         3.62  3.5     9.3                116         4800.0    24        30           8449.0   116.0          1
                                                                                                                                                                                                                                                                                                                                            ..
wagon        0          89                 subaru         gas        std         four          fwd           front            97.0        173.5   65.4   53.0    2290         ohcf         four              108          2bbl         3.62  2.64    9.0                82          4800.0    28        32           7463.0   82.0           1
                                                                                                                                                                 2455         ohcf         four              108          mpfi         3.62  2.64    9.0                94          5200.0    25        31           10198.0  94.0           1
                        91                 toyota         gas        std         four          4wd           front            95.7        169.7   63.6   59.1    3110         ohc          four              92           2bbl         3.05  3.03    9.0                62          4800.0    27        32           8778.0   62.0           1
             1          103                nissan         gas        std         four          fwd           front            94.5        170.2   63.8   53.5    2024         ohc          four              97           2bbl         3.15  3.29    9.4                69          5200.0    31        37           7349.0   69.0           1
                                                                                                                                                                 2037         ohc          four              97           2bbl         3.15  3.29    9.4                69          5200.0    31        37           7999.0   69.0           1
Name: count, Length: 159, dtype: int64

In [174]:
data['body-style'].value_counts()

body-style
sedan          96
hatchback      70
wagon          25
hardtop         8
convertible     6
Name: count, dtype: int64

In [175]:
data['fuel-type'].value_counts(normalize=True)

fuel-type
gas       0.902439
diesel    0.097561
Name: proportion, dtype: float64

In [178]:
data.groupby(by='body-style')['highway-mpg'].mean()

body-style
convertible    26.000000
hardtop        27.250000
hatchback      32.171429
sedan          30.833333
wagon          28.720000
Name: highway-mpg, dtype: float64

In [179]:
data.groupby(by='body-style')['highway-mpg'].mean().sort_values(ascending=False)

body-style
hatchback      32.171429
sedan          30.833333
wagon          28.720000
hardtop        27.250000
convertible    26.000000
Name: highway-mpg, dtype: float64

In [181]:
data.groupby(by='aspiration')['highway-mpg'].mean().sort_values()

aspiration
turbo    27.027027
std      31.571429
Name: highway-mpg, dtype: float64

In [183]:
data.groupby(by='aspiration')['city-mpg'].mean().sort_values(ascending=False)

aspiration
std      25.839286
turbo    22.405405
Name: city-mpg, dtype: float64

In [185]:
data.groupby(by=['body-style','fuel-type'])['city-mpg'].mean()

body-style   fuel-type
convertible  gas          20.500000
hardtop      diesel       22.000000
             gas          21.571429
hatchback    diesel       38.000000
             gas          26.144928
sedan        diesel       31.600000
             gas          24.160494
wagon        diesel       24.000000
             gas          24.045455
Name: city-mpg, dtype: float64

In [187]:
data.groupby(by=['aspiration','fuel-type'])['city-mpg'].mean()

aspiration  fuel-type
std         diesel       36.857143
            gas          25.360248
turbo       diesel       26.769231
            gas          20.041667
Name: city-mpg, dtype: float64

In [188]:
data.groupby(by=['fuel-type','aspiration'])['city-mpg'].mean()

fuel-type  aspiration
diesel     std           36.857143
           turbo         26.769231
gas        std           25.360248
           turbo         20.041667
Name: city-mpg, dtype: float64

In [193]:
data['comb-mpg']=(data['city-mpg']+data['highway-mpg'])

In [194]:
data.head()

,symboling,normalized-losses,make,fuel-type,aspiration,num-of-doors,body-style,drive-wheels,engine-location,wheel-base,...,bore,stroke,compression-ratio,horsepower,peak-rpm,city-mpg,highway-mpg,price,hoursepower,comb-mpg
0,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,3.47,2.68,9.0,111,5000.0,21,27,13495.0,111.0,48
1,3,NaN,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,3.47,2.68,9.0,111,5000.0,21,27,16500.0,111.0,48
2,1,NaN,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,2.68,3.47,9.0,154,5000.0,19,26,16500.0,154.0,45
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,3.19,3.4,10.0,102,5500.0,24,30,13950.0,102.0,54
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,3.19,3.4,8.0,115,5500.0,18,22,17450.0,115.0,40